1s/ERP/extensions/liko/DataProcessors/ПриложениеКВБЗЕРП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПриложениеКВБЗЕРП</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерБланка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриложения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЗакрыватьФорму</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

1s/ERP/extensions/liko/DataProcessors/ПриложениеКВБЗЕРП/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Параметры.ОбъектыНазначения = Неопределено Тогда 
		Объект.Заказ = Параметры.ОбъектыНазначения[0];
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Функция ПечатьНаСервере()
	//МассивДокументов = Параметры.ОбъектыНазначения;
	ЭтотОбъектОбработка = РеквизитФормыВЗначение("Объект");

   // ТабДок =ЭтотОбъектОбработка.Печать(МассивДокументов);
   ТабДок =ЭтотОбъектОбработка.ПечатьПриложениеВБЗ();
   
    Возврат ТабДок;	
КонецФункции
 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.НомерБланка = 1;
	Объект.НомерПриложения= 1;
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ТабДок =ПечатьНаСервере();
	ТабДок.Показать();

	Если Не Объект.НеЗакрыватьФорму Тогда 
		ЭтаФорма.Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СразуНаПринтер(Команда)	
	ТабДок =ПечатьНаСервере();
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.АвтоМасштаб=Истина;
	ТабДок.ЭкземпляровНаСтранице=1;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВлево;
	ТабДок.Напечатать(Истина);
	Если Не Объект.НеЗакрыватьФорму Тогда 
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры
